uli/basicengine-firmware/libraries/ESP8266SAM/src/render.cpp
    // get the ranking of each phoneme
    X = A;
    mem56 = pgm_read_byte(blendRank+A);             //blendRank[A];
    A = pgm_read_byte(blendRank+Y);             //blendRank[Y];

    // compare the rank - lower rank value is stronger
    if (A == mem56)
    {
      // same rank, so use out blend lengths from each phoneme
      phase1 = pgm_read_byte(outBlendLength+Y);                  //outBlendLength[Y];
      phase2 = pgm_read_byte(outBlendLength+X);                  //outBlendLength[X];
    } else
    if (A < mem56)
    {
      // first phoneme is stronger, so us it's blend lengths
      phase1 = pgm_read_byte(inBlendLength+X);                  //inBlendLength[X];
      phase2 = pgm_read_byte(outBlendLength+X);                  //outBlendLength[X];
    } else
    {
      // second phoneme is stronger, so use it's blend lengths
      // note the out/in are swapped
      phase1 = pgm_read_byte(outBlendLength+Y);                  //outBlendLength[Y];
      phase2 = pgm_read_byte(inBlendLength+Y);                  //inBlendLength[Y];
    }

    Y = mem44;
    A = mem49 + phonemeLengthOutput[mem44];             // A is mem49 + length
    mem49 = A;             // mem49 now holds length + position
    A = A + phase2;             //Maybe Problem because of carry flag

    //47776: ADC 42
    speedcounter = A;
    mem47 = 168;
    phase3 = mem49 - phase1;             // what is mem49
    A = phase1 + phase2;             // total transition?
    mem38 = A;

    X = A;
    X -= 2;
    if ((X & 128) == 0)
      do             //while No. 2
      {
	//pos47810:

	// mem47 is used to index the tables:
	// 168  pitches[]
	// 169  frequency1
	// 170  frequency2
	// 171  frequency3
	// 172  amplitude1
	// 173  amplitude2
	// 174  amplitude3

	mem40 = mem38;

	if (mem47 == 168)                     // pitch
	{

	  // unlike the other values, the pitches[] interpolates from
	  // the middle of the current phoneme to the middle of the
	  // next phoneme

	  unsigned char mem36, mem37;
	  // half the width of the current phoneme
	  mem36 = phonemeLengthOutput[mem44] >> 1;
	  // half the width of the next phoneme
	  mem37 = phonemeLengthOutput[mem44+1] >> 1;
	  // sum the values
	  mem40 = mem36 + mem37;                       // length of both halves
	  mem37 += mem49;                       // center of next phoneme
	  mem36 = mem49 - mem36;                       // center index of current phoneme
	  A = Read(mem47, mem37);                       // value at center of next phoneme - end interpolation value
	  //A = mem[address];

	  Y = mem36;                       // start index of interpolation
	  mem53 = A - Read(mem47, mem36);                       // value to center of current phoneme
	} else
	{
	  // value to interpolate to
	  A = Read(mem47, speedcounter);
	  // position to start interpolation from
	  Y = phase3;
	  // value to interpolate from
	  mem53 = A - Read(mem47, phase3);
	}

	//Code47503(mem40);
	// ML : Code47503 is division with remainder, and mem50 gets the sign

	// calculate change per frame
	signed char m53 = (signed char)mem53;
	mem50 = mem53 & 128;
	unsigned char m53abs = abs(m53);
	mem51 = m53abs % mem40;                 //abs((char)m53) % mem40;
	mem53 = (unsigned char)((signed char)(m53) / mem40);
	// interpolation range
	X = mem40;                 // number of frames to interpolate over
	Y = phase3;                 // starting frame


	// linearly interpolate values

	mem56 = 0;
	//47907: CLC
	//pos47908:
	while (1)                    //while No. 3
	{
	  A = Read(mem47, Y) + mem53;                       //carry alway cleared

	  mem48 = A;
	  Y++;
	  X--;
	  if (X == 0) break;

	  mem56 += mem51;
	  if (mem56 >= mem40)                        //???
	  {
	    mem56 -= mem40;                             //carry? is set
	    //if ((mem56 & 128)==0)
	    if ((mem50 & 128) == 0)
	    {
	      //47935: BIT 50
	      //47937: BMI 47943
	      if (mem48 != 0) mem48++;
	    } else mem48--;
	  }
	  //pos47945:
	  Write(mem47, Y, mem48);
	}                 //while No. 3

	//pos47952:
	mem47++;
	//if (mem47 != 175) goto pos47810;
      } while (mem47 != 175);               //while No. 2
    //pos47963:
    mem44++;
    X = mem44;
  }        //while No. 1
  yield();
  //goto pos47701;
  //pos47970:

  // add the length of this phoneme
  mem48 = mem49 + phonemeLengthOutput[mem44];


// ASSIGN PITCH CONTOUR
//
// This subtracts the F1 frequency from the pitch to create a
// pitch contour. Without this, the output would be at a single
// pitch level (monotone).


  // don't adjust pitch if in sing mode
  if (!singmode)
  {
    // iterate through the buffer
    for (i = 0; i < 256; i++) {
      // subtract half the frequency of the formant 1.
      // this adds variety to the voice
      pitches[i] -= (frequency1[i] >> 1);
    }
  }

  phase1 = 0;
  phase2 = 0;
  phase3 = 0;
  mem49 = 0;
  speedcounter = 72;       //sam standard speed

// RESCALE AMPLITUDE
//
// Rescale volume from a linear scale to decibels.
//

  //amplitude rescaling
  for (i = 255; i >= 0; i--)
  {
    amplitude1[i] = pgm_read_byte(amplitudeRescale + amplitude1[i]);            //amplitudeRescale[amplitude1[i]];
    amplitude2[i] = pgm_read_byte(amplitudeRescale + amplitude2[i]);            //amplitudeRescale[amplitude2[i]];
    amplitude3[i] = pgm_read_byte(amplitudeRescale + amplitude3[i]);            //amplitudeRescale[amplitude3[i]];
  }

  Y = 0;
  A = pitches[0];
  mem44 = A;
  X = A;
  mem38 = A - (A>>2);           // 3/4*A ???
  yield();
  if (debug)
  {
    PrintOutput(sampledConsonantFlag, frequency1, frequency2, frequency3, amplitude1, amplitude2, amplitude3, pitches);
  }

  render_state = RENDER_LOOP;
}

void ESP8266SAM::RenderLoop()
{
  if (render_state == RENDER_SAMPLE_END) {
    render_state = RENDER_LOOP;
    if (last_render_sample_call == 1)
      goto render_sample_call_1;
    else
      goto render_sample_call_2;
  }
// PROCESS THE FRAMES
//
// In traditional vocal synthesis, the glottal pulse drives filters, which
// are attenuated to the frequencies of the formants.
//
// SAM generates these formants directly with sin and rectangular waves.
// To simulate them being driven by the glottal pulse, the waveforms are
// reset at the beginning of each glottal pulse.

  //finally the loop for sound output
  //pos48078:
  // get the sampled information on the phoneme
  A = sampledConsonantFlag[Y];
  mem39 = A;

