uli/basicengine-firmware/libraries/ESP8266SAM/src/render.cpp
  // unvoiced sampled phoneme?
  A = A & 248;
  if (A != 0)
  {
    // render the sample for the phoneme
    RenderSample();
    if (render_state != RENDER_SAMPLE_END) {
      last_render_sample_call = 1;
      return;
    }
    render_state = RENDER_LOOP;
render_sample_call_1:
    // skip ahead two in the phoneme buffer
    Y += 2;
    mem48 -= 2;
  } else
  {
    // simulate the glottal pulse and formants
    unsigned char ary[5];
    unsigned int p1 = phase1 * 256;                     // Fixed point integers because we need to divide later on
    unsigned int p2 = phase2 * 256;
    unsigned int p3 = phase3 * 256;

    for (int k = 0; k < 5; k++) {
      signed char sp1 = (signed char)pgm_read_byte(&sinus[0xff & (p1>>8)]);
      signed char sp2 = (signed char)pgm_read_byte(&sinus[0xff & (p2>>8)]);
      signed char rp3 = (signed char)pgm_read_byte(&rectangle[0xff & (p3>>8)]);
      signed int sin1 = sp1 * ((unsigned char)amplitude1[Y] & 0x0f);
      signed int sin2 = sp2 * ((unsigned char)amplitude2[Y] & 0x0f);
      signed int rect = rp3 * ((unsigned char)amplitude3[Y] & 0x0f);
      signed int mux = sin1 + sin2 + rect;
      mux /= 32;
      mux += 128;                           // Go from signed to unsigned amplitude
      ary[k] = mux;
      p1 += ((int)frequency1[Y]) * 256 / 4;                           // Compromise, this becomes a shift and works well
      p2 += ((int)frequency2[Y]) * 256 / 4;
      p3 += ((int)frequency3[Y]) * 256 / 4;
    }
    // output the accumulated value
    Output8BitAry(0, ary);
    speedcounter--;
    if (speedcounter != 0) goto pos48155;
    Y++;                     //go to next amplitude

    // decrement the frame count
    mem48--;
  }

  // if the frame count is zero, exit the loop
  if (mem48 == 0) {
    if (last_loop)
      render_state = RENDER_IDLE;
    else
      render_state = RENDER_PREP;
    return;
  }
  speedcounter = speed;
pos48155:

  // decrement the remaining length of the glottal pulse
  mem44--;

  // finished with a glottal pulse?
  if (mem44 == 0)
  {
pos48159:
    // fetch the next glottal pulse length
    A = pitches[Y];
    mem44 = A;
    A = A - (A>>2);
    mem38 = A;

    // reset the formant wave generators to keep them in
    // sync with the glottal pulse
    phase1 = 0;
    phase2 = 0;
    phase3 = 0;
    return;
  }

  // decrement the count
  mem38--;

  // is the count non-zero and the sampled flag is zero?
  if ((mem38 != 0) || (mem39 == 0))
  {
    // reset the phase of the formants to match the pulse
    phase1 += frequency1[Y];
    phase2 += frequency2[Y];
    phase3 += frequency3[Y];
    return;
  }

  // voiced sampled phonemes interleave the sample with the
  // glottal pulse. The sample flag is non-zero, so render
  // the sample for the phoneme.
  RenderSample();
  if (render_state != RENDER_SAMPLE_END) {
    last_render_sample_call = 2;
    return;
  }
  render_state = RENDER_LOOP;
render_sample_call_2:
  goto pos48159;

}


// Create a rising or falling inflection 30 frames prior to
// index X. A rising inflection is used for questions, and
// a falling inflection is used for statements.

void ESP8266SAM::AddInflection(unsigned char mem48, unsigned char phase1)
{
  //pos48372:
  //	mem48 = 255;
//pos48376:

  // store the location of the punctuation
  mem49 = X;
  A = X;
  int Atemp = A;

  // backup 30 frames
  A = A - 30;
  // if index is before buffer, point to start of buffer
  if (Atemp <= 30) A = 0;
  X = A;

  // FIXME: Explain this fix better, it's not obvious
  // ML : A =, fixes a problem with invalid pitch with '.'
  while ((A = pitches[X]) == 127) X++;


pos48398:
  //48398: CLC
  //48399: ADC 48

  // add the inflection direction
  A += mem48;
  phase1 = A;

  // set the inflection
  pitches[X] = A;
pos48406:

  // increment the position
  X++;

  // exit if the punctuation has been reached
  if (X == mem49) return;       //goto pos47615;
  if (pitches[X] == 255) goto pos48406;
  A = phase1;
  goto pos48398;
}

/*
    SAM's voice can be altered by changing the frequencies of the
    mouth formant (F1) and the throat formant (F2). Only the voiced
    phonemes (5-29 and 48-53) are altered.
 */
// mouth formants (F1) 5..29
const unsigned char mouthFormants5_29[30] PROGMEM = {
  0, 0, 0, 0, 0, 10,
  14, 19, 24, 27, 23, 21, 16, 20, 14, 18, 14, 18, 18,
  16, 13, 15, 11, 18, 14, 11, 9, 6, 6, 6
};

// throat formants (F2) 5..29
const unsigned char throatFormants5_29[30] PROGMEM = {
  255, 255,
  255, 255, 255, 84, 73, 67, 63, 40, 44, 31, 37, 45, 73, 49,
  36, 30, 51, 37, 29, 69, 24, 50, 30, 24, 83, 46, 54, 86
};

// there must be no zeros in this 2 tables
// formant 1 frequencies (mouth) 48..53
const unsigned char mouthFormants48_53[6] PROGMEM = {19, 27, 21, 27, 18, 13};

// formant 2 frequencies (throat) 48..53
const unsigned char throatFormants48_53[6] PROGMEM = {72, 39, 31, 43, 30, 34};

void ESP8266SAM::SetMouthThroat(unsigned char mouth, unsigned char throat)
{
  unsigned char initialFrequency;
  unsigned char newFrequency = 0;
  //unsigned char mouth; //mem38880
  //unsigned char throat; //mem38881

  unsigned char pos = 5;       //mem39216
//pos38942:
  // recalculate formant frequencies 5..29 for the mouth (F1) and throat (F2)
  while (pos != 30)
  {
    // recalculate mouth frequency
    initialFrequency = pgm_read_byte(&mouthFormants5_29[pos]);
    if (initialFrequency != 0) newFrequency = trans(mouth, initialFrequency);
    freq1data[pos] = newFrequency;

    // recalculate throat frequency
    initialFrequency = pgm_read_byte(&throatFormants5_29[pos]);
    if (initialFrequency != 0) newFrequency = trans(throat, initialFrequency);
    freq2data[pos] = newFrequency;
    pos++;
  }

//pos39059:
  // recalculate formant frequencies 48..53
  pos = 48;
  Y = 0;
  while (pos != 54)
  {
    // recalculate F1 (mouth formant)
    initialFrequency = pgm_read_byte(&mouthFormants48_53[Y]);
    newFrequency = trans(mouth, initialFrequency);
    freq1data[pos] = newFrequency;

    // recalculate F2 (throat formant)
    initialFrequency = pgm_read_byte(&throatFormants48_53[Y]);
    newFrequency = trans(throat, initialFrequency);
    freq2data[pos] = newFrequency;
    Y++;
    pos++;
  }
}


//return = (mem39212*mem39213) >> 1
unsigned char ESP8266SAM::trans(unsigned char mem39212, unsigned char mem39213)
{
  //pos39008:
  unsigned char carry;
  int temp;
  unsigned char mem39214, mem39215;
  A = 0;
  mem39215 = 0;
  mem39214 = 0;
  X = 8;
  do
  {
    carry = mem39212 & 1;
    mem39212 = mem39212 >> 1;
    if (carry != 0)
    {
      /*
                              39018: LSR 39212
                              39021: BCC 39033
       */
      carry = 0;
      A = mem39215;
      temp = (int)A + (int)mem39213;
      A = A + mem39213;
      if (temp > 255) carry = 1;
      mem39215 = A;
    }
    temp = mem39215 & 1;
    mem39215 = (mem39215 >> 1) | (carry ? 128 : 0);
    carry = temp;
    //39033: ROR 39215
    X--;
  } while (X != 0);
  temp = mem39214 & 128;
  mem39214 = (mem39214 << 1) | (carry ? 1 : 0);
  carry = temp;
  temp = mem39215 & 128;
  mem39215 = (mem39215 << 1) | (carry ? 1 : 0);
  carry = temp;

  return mem39215;
}
